awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F092xx.svd
        <register>
          <name>CPAR6</name>
          <addressOffset>0x74</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR6</name>
          <addressOffset>0x78</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCFGR6</name>
          <addressOffset>0x7C</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR7</name>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>EN</name>
              <description>Channel Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TCIE</name>
              <description>Transfer Complete Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BTCIE</name>
              <description>Block Transfer Complete Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>HBTIE</name>
              <description>Half Block Transfer Complete Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TEIE</name>
              <description>Transfer Error Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <description>Data Transfer Direction</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CIRC</name>
              <description>Circular Mode</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TRANST</name>
              <description>Transfer Type</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>PINC</name>
              <description>Peripheral Increment Mode</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>MINC</name>
              <description>Memory Increment Mode</description>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>PSIZE</name>
              <description>Peripheral Size</description>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>MSIZE</name>
              <description>Memory Size</description>
              <bitRange>[15:14]</bitRange>
            </field>
            <field>
              <name>PL</name>
              <description>Priority Level</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>MEM2MEM</name>
              <description>Memory-to-memory Mode</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>PNORLD</name>
              <description>Peripheral No Reload</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>MNORLD</name>
              <description>Memory No Reload</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>BTCSUSP</name>
              <description>Suspend in Block Transfer Complete Interrupt</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>M2MARB</name>
              <description>Memory-to-memory Mode Arbitration</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNDTR7</name>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>NDT</name>
              <description>Number of Data to Transfer</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CPAR7</name>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>PA</name>
              <description>Peripheral Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CMAR7</name>
          <addressOffset>0x8C</addressOffset>
          <fields>
            <field>
              <name>MA</name>
              <description>Memory Address</description>
              <bitRange>[31:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCFGR7</name>
          <addressOffset>0x90</addressOffset>
          <fields>
            <field>
              <name>NBT</name>
              <description>Number of Block to Loop Transfer</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NDTL</name>
              <description>Number of Data to Transfer Last Loop</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
