awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F092xx.svd
        <register>
          <name>IE</name>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>RF0NE</name>
              <description>Rx FIFO 1 New Message Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF0WE</name>
              <description>Rx FIFO 1 Watermark Reached Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF0FE</name>
              <description>Rx FIFO 1 Full Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RF0LE</name>
              <description>Rx FIFO 1 Message Lost Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF1NE</name>
              <description>Rx FIFO 2 New Message Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF1WE</name>
              <description>Rx FIFO 2 Watermark Reached Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RF1FE</name>
              <description>Rx FIFO 2 Full Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RF1LE</name>
              <description>Rx FIFO 2 Message Lost Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>HPME</name>
              <description>High Priority Message Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TCE</name>
              <description>Transmission Completed Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TCFE</name>
              <description>Transmission Cancellation Finished Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TFEE</name>
              <description>Tx FIFO Empty Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TEFNE</name>
              <description>Tx Event FIFO New Entry Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TEFWE</name>
              <description>Tx Event FIFO Watermark Reached Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TEFFE</name>
              <description>Tx Event FIFO Full Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TEFLE</name>
              <description>Tx Event FIFO Event Lost Interrupt Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TSWE</name>
              <description>Timestamp Wraparound Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>MRAFE</name>
              <description>Message RAM Access Failure Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TOOE</name>
              <description>Timeout Occurred Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DRXE</name>
              <description>Message stored to Dedicated Rx Buffer Interrupt Enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BECE</name>
              <description>Bit Error Corrected Interrupt Enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BEUE</name>
              <description>Bit Error Uncorrected Interrupt Enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ELOE</name>
              <description>Error Logging Overflow Interrupt Enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EPE</name>
              <description>Error Passive Interrupt Enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EWE</name>
              <description>Warning Status Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>BOE</name>
              <description>Bus_Off Status Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>WDIE</name>
              <description>Watchdog Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PEAE</name>
              <description>Protocol Error in Arbitration Phase Enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PEDE</name>
              <description>Protocol Error in Data Phase Enable</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ARAE</name>
              <description>Access to Reserved Address Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ILS</name>
          <addressOffset>0x58</addressOffset>
          <fields>
            <field>
              <name>RF0NL</name>
              <description>Rx FIFO 1 New Message Interrupt Line</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RF0WL</name>
              <description>Rx FIFO 1 Watermark Reached Interrupt Line</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>RF0FL</name>
              <description>Rx FIFO 1 Full Interrupt Line</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>RF0LL</name>
              <description>Rx FIFO 1 Message Lost Interrupt Line</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>RF1NL</name>
              <description>Rx FIFO 2 New Message Interrupt Line</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RF1WL</name>
              <description>Rx FIFO 2 Watermark Reached Interrupt Line</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>RF1FL</name>
              <description>Rx FIFO 2 Full Interrupt Line</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>RF1LL</name>
              <description>Rx FIFO 2 Message Lost Interrupt Line</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>HPML</name>
              <description>High Priority Message Interrupt Line</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TCL</name>
              <description>Transmission Completed Interrupt Line</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TCFL</name>
              <description>Transmission Cancellation Finished Interrupt Line</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TFEL</name>
              <description>Tx FIFO Empty Interrupt Line</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TEFNL</name>
              <description>Tx Event FIFO New Entry Interrupt Line</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TEFWL</name>
              <description>Tx Event FIFO Watermark Reached Interrupt Line</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TEFFL</name>
              <description>Tx Event FIFO Full Interrupt Line</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TEFLL</name>
              <description>Tx Event FIFO Event Lost Interrupt Line</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TSWL</name>
              <description>Timestamp Wraparound Interrupt Line</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>MRAFL</name>
              <description>Message RAM Access Failure Interrupt Line</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TOOL</name>
              <description>Timeout Occurred Interrupt Line</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>DRXL</name>
              <description>Message stored to Dedicated Rx Buffer Interrupt Line</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>BECL</name>
              <description>Bit Error Corrected Interrupt Line</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>BEUL</name>
              <description>Bit Error Uncorrected Interrupt Line</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ELOL</name>
              <description>Error Logging Overflow Interrupt Line</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>EPL</name>
              <description>Error Passive Interrupt Line</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EWL</name>
              <description>Warning Status Interrupt Line</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>BOL</name>
              <description>Bus_Off Status Interrupt Line</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>WDIL</name>
              <description>Watchdog Interrupt Line</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>PEAL</name>
              <description>Protocol Error in Arbitration Phase Line</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>PEDL</name>
              <description>Protocol Error in Data Phase Line</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ARAL</name>
              <description>Access to Reserved Address Line</description>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ILE</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>EINT0</name>
              <description>Enable Interrupt Line 0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>EINT1</name>
              <description>Enable Interrupt Line 1</description>
              <bitRange>[1:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>GFC</name>
          <addressOffset>0x80</addressOffset>
          <fields>
            <field>
              <name>RRFE</name>
              <description>Reject Remote Frames Extended</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>RRFS</name>
              <description>Reject Remote Frames Standard</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ANFE</name>
              <description>Accept Non-matching Frames Extended</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>ANFS</name>
              <description>Accept Non-matching Frames Standard</description>
              <bitRange>[5:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SIDFC</name>
          <addressOffset>0x84</addressOffset>
          <fields>
            <field>
              <name>FLSSA</name>
              <description>Filter List Standard Start Address</description>
              <bitRange>[15:2]</bitRange>
            </field>
            <field>
              <name>LSS</name>
              <description>List Size Standard</description>
              <bitRange>[23:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XIDFC</name>
          <addressOffset>0x88</addressOffset>
          <fields>
            <field>
              <name>FLESA</name>
              <description>Filter List Extended Start Address</description>
              <bitRange>[15:2]</bitRange>
            </field>
            <field>
              <name>LSE</name>
              <description>List Size Extended</description>
              <bitRange>[22:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>XIDAM</name>
          <addressOffset>0x90</addressOffset>
          <fields>
            <field>
              <name>EIDM</name>
              <description>Extended ID Mask</description>
              <bitRange>[28:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>HPMS</name>
          <addressOffset>0x94</addressOffset>
          <fields>
            <field>
              <name>BIDX</name>
              <description>Buffer Index</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MSI</name>
              <description>Message Storage Indicator</description>
              <bitRange>[7:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FIDX</name>
              <description>Filter Index</description>
              <bitRange>[14:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FLST</name>
              <description>Filter List</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>NDAT1</name>
          <addressOffset>0x98</addressOffset>
          <fields>
            <field>
              <name>ND0</name>
              <description>New Data0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ND1</name>
              <description>New Data1</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>ND2</name>
              <description>New Data2</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>ND3</name>
              <description>New Data3</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ND4</name>
              <description>New Data4</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ND5</name>
              <description>New Data5</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ND6</name>
              <description>New Data6</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ND7</name>
              <description>New Data7</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ND8</name>
              <description>New Data8</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ND9</name>
              <description>New Data9</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ND10</name>
              <description>New Data10</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>ND11</name>
              <description>New Data11</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ND12</name>
              <description>New Data12</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ND13</name>
              <description>New Data13</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>ND14</name>
              <description>New Data14</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ND15</name>
              <description>New Data15</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ND16</name>
              <description>New Data16</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>ND17</name>
              <description>New Data17</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>ND18</name>
              <description>New Data18</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>ND19</name>
              <description>New Data19</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>ND20</name>
              <description>New Data20</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>ND21</name>
              <description>New Data21</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>ND22</name>
              <description>New Data22</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>ND23</name>
              <description>New Data23</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ND24</name>
              <description>New Data24</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ND25</name>
              <description>New Data25</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>ND26</name>
              <description>New Data26</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>ND27</name>
              <description>New Data27</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>ND28</name>
              <description>New Data28</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>ND29</name>
              <description>New Data29</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>ND30</name>
              <description>New Data30</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ND31</name>
              <description>New Data31</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
