awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F092xx.svd
        <register>
          <name>TXBCF</name>
          <addressOffset>0xDC</addressOffset>
          <fields>
            <field>
              <name>CF0</name>
              <description>Cancellation Finished</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF1</name>
              <description>Cancellation Finished</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF2</name>
              <description>Cancellation Finished</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF3</name>
              <description>Cancellation Finished</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF4</name>
              <description>Cancellation Finished</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF5</name>
              <description>Cancellation Finished</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF6</name>
              <description>Cancellation Finished</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF7</name>
              <description>Cancellation Finished</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF8</name>
              <description>Cancellation Finished</description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF9</name>
              <description>Cancellation Finished</description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF10</name>
              <description>Cancellation Finished</description>
              <bitRange>[10:10]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF11</name>
              <description>Cancellation Finished</description>
              <bitRange>[11:11]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF12</name>
              <description>Cancellation Finished</description>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF13</name>
              <description>Cancellation Finished</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF14</name>
              <description>Cancellation Finished</description>
              <bitRange>[14:14]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF15</name>
              <description>Cancellation Finished</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF16</name>
              <description>Cancellation Finished</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF17</name>
              <description>Cancellation Finished</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF18</name>
              <description>Cancellation Finished</description>
              <bitRange>[18:18]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF19</name>
              <description>Cancellation Finished</description>
              <bitRange>[19:19]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF20</name>
              <description>Cancellation Finished</description>
              <bitRange>[20:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF21</name>
              <description>Cancellation Finished</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF22</name>
              <description>Cancellation Finished</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF23</name>
              <description>Cancellation Finished</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF24</name>
              <description>Cancellation Finished</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF25</name>
              <description>Cancellation Finished</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF26</name>
              <description>Cancellation Finished</description>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF27</name>
              <description>Cancellation Finished</description>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF28</name>
              <description>Cancellation Finished</description>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF29</name>
              <description>Cancellation Finished</description>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF30</name>
              <description>Cancellation Finished</description>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CF31</name>
              <description>Cancellation Finished</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBTIE</name>
          <addressOffset>0xE0</addressOffset>
          <fields>
            <field>
              <name>TIE0</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>TIE1</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>TIE2</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>TIE3</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TIE4</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>TIE5</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIE6</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>TIE7</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>TIE8</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>TIE9</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>TIE10</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TIE11</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>TIE12</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TIE13</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TIE14</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TIE15</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>TIE16</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TIE17</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>TIE18</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>TIE19</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>TIE20</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>TIE21</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>TIE22</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>TIE23</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>TIE24</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TIE25</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TIE26</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>TIE27</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>TIE28</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>TIE29</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>TIE30</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>TIE31</name>
              <description>Transmission Interrupt Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXBCIE</name>
          <addressOffset>0xE4</addressOffset>
          <fields>
            <field>
              <name>CFIE0</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CFIE1</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CFIE2</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CFIE3</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CFIE4</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CFIE5</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CFIE6</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CFIE7</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CFIE8</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CFIE9</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CFIE10</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CFIE11</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CFIE12</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CFIE13</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CFIE14</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CFIE15</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>CFIE16</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>CFIE17</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>CFIE18</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>CFIE19</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>CFIE20</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>CFIE21</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>CFIE22</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>CFIE23</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>CFIE24</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>CFIE25</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>CFIE26</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>CFIE27</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>CFIE28</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>CFIE29</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>CFIE30</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>CFIE31</name>
              <description>Cancellation Finished Interrupt Enable</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXEFC</name>
          <addressOffset>0xF0</addressOffset>
          <fields>
            <field>
              <name>EFSA</name>
              <description>Event FIFO Start Address</description>
              <bitRange>[15:2]</bitRange>
            </field>
            <field>
              <name>EFS</name>
              <description>Event FIFO Size</description>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>EFWM</name>
              <description>Event FIFO Watermark</description>
              <bitRange>[29:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXEFS</name>
          <addressOffset>0xF4</addressOffset>
          <fields>
            <field>
              <name>EFFL</name>
              <description>Event FIFO Fill Level</description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EFGI</name>
              <description>Event FIFO Get Index</description>
              <bitRange>[12:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EFPI</name>
              <description>Event FIFO Put Index</description>
              <bitRange>[20:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EFF</name>
              <description>Event FIFO Full</description>
              <bitRange>[24:24]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TEFL</name>
              <description>Tx Event FIFO Element Lost</description>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXEFA</name>
          <addressOffset>0xF8</addressOffset>
          <fields>
            <field>
              <name>EFAI</name>
              <description>Event FIFO Acknowledge Index</description>
              <bitRange>[4:0]</bitRange>
            </field>
          </fields>
        </register>
