awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F092xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FLASH</name>
      <description>desc FLASH</description>
      <baseAddress>0x40022000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>FLASH</name>
        <description>FLASH global Interrupt</description>
        <value>3</value>
      </interrupt>
      <registers>
        <register>
          <name>ACR</name>
          <description>desc ACR</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>LATENCY</name>
              <description>Latency</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>PRFTEN</name>
              <description>Prefect enable</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ICEN</name>
              <description>Instruction cache enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>DCEN</name>
              <description>Data cache enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>KEYR</name>
          <description>desc KEYR</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>KEY</name>
              <description>Flash CR key</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTKEYR</name>
          <description>desc OPTKEYR</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>OPTKEY</name>
              <description>Flash Option key</description>
              <bitRange>[31:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>EOP</name>
              <description>End of operation</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>WRPERR</name>
              <description>Write protection error</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>RDERR0</name>
              <description>Bank0 pcrop read error</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>RDERR1</name>
              <description>Bank1 pcrop read error</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>USRLOCK</name>
              <description>Userdata Lock</description>
              <bitRange>[13:13]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>OPTVERR</name>
              <description>Option and trimming bits loading validity error</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BSY0</name>
              <description>Bank0 Busy</description>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BSY1</name>
              <description>Bank1 Busy</description>
              <bitRange>[17:17]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>desc CR</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>PG</name>
              <description>Page Program</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PER</name>
              <description>Page Erase</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>MER0</name>
              <description>Bank 0 Mass Erase</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>MER1</name>
              <description>Bank 1 Mass Erase</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>UPG</name>
              <description>Userdata Program</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>UPER</name>
              <description>Userdata Page Erase</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>SER</name>
              <description>Sector Erase</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OPTSTRT</name>
              <description>Option bytes Programming Start</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>UPGSTRT</name>
              <description>Userdata Programming Start</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>PGSTRT</name>
              <description>Programming Start</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>RDERR0IE</name>
              <description>Bank0 pcrop read error interrupt enable</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>RDERR1IE</name>
              <description>Bank1 pcrop read error interrupt enable</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>EOPIE</name>
              <description>End of operation interrupt enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ERRIE</name>
              <description>Error interrupt enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>OBL_LAUNCH</name>
              <description>Force the option bytes loading</description>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>OPTLOCK</name>
              <description>Option Lock</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <description>Lock</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ECCR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>ADDR_ECC</name>
              <description>ECC fail address</description>
              <bitRange>[16:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BK_ECC</name>
              <description>ECC fail bank</description>
              <bitRange>[21:21]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SYSF_ECC</name>
              <description>System Flash ECC fail</description>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ECCCIE</name>
              <description>ECC correction interrupt enable</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ECCC</name>
              <description>ECC correction</description>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>ECCD</name>
              <description>ECC detection</description>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OPTR</name>
          <description>desc OPTR</description>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>RDP</name>
              <description>Read Protection</description>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>NRST_STANDBY</name>
              <description>nrst standby</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>NRST_STOP</name>
              <description>nrst stop</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>IWDG_STDBY</name>
              <description>IWDG Standy Count Control</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>IWDG_STOP</name>
              <description>IWDG Stop Count Control</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>IWDG_SW</name>
              <description>IWDG Software Enable</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WWDG_SW</name>
              <description>WWDG Software Enable</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>NRST_MODE</name>
              <description>nrst mode</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>NBOOT1</name>
              <description>nboot1</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BOR_EN</name>
              <description>BOR enable</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>BOR_LEV</name>
              <description>BOR Level</description>
              <bitRange>[19:17]</bitRange>
            </field>
            <field>
              <name>SRAM_PE</name>
              <description>sram parity enable</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>SWD_MODE</name>
              <description>SWD mode</description>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>BFB</name>
              <description>Boot Flash Bank</description>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>BOOT_LOCK</name>
              <description>Boot Lock</description>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>ECC_EN</name>
              <description>ECC enable</description>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WRPR</name>
          <description>desc WRPR</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>BK0_WRPX</name>
              <description>Bank0 Sector Write Protection</description>
              <bitRange>[15:0]</bitRange>
            </field>
            <field>
              <name>BK1_WRPX</name>
              <description>Bank1 Sector Write Protection</description>
              <bitRange>[31:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCROPR0</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>PCROP0SR</name>
              <description>Bank0 pcrop start address</description>
              <bitRange>[8:0]</bitRange>
            </field>
            <field>
              <name>PCROP0ER</name>
              <description>Bank0 pcrop end address</description>
              <bitRange>[24:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCROPR1</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>PCROP1SR</name>
              <description>Bank1 pcrop start address</description>
              <bitRange>[8:0]</bitRange>
            </field>
            <field>
              <name>PCROP1ER</name>
              <description>Bank1 pcrop end address</description>
              <bitRange>[24:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>LPCR</name>
          <addressOffset>0x90</addressOffset>
          <fields>
            <field>
              <name>SLEEP_EN</name>
              <description>Sleep enable</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SLEEP_TIME</name>
              <description>Sleep time</description>
              <bitRange>[15:8]</bitRange>
            </field>
            <field>
              <name>LPRUN_ENTERT</name>
              <description>Low power run mode enter time</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>LPRUN_EXITT</name>
              <description>Low power run mode exit time</description>
              <bitRange>[22:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS0</name>
          <description>desc TS0</description>
          <addressOffset>0x100</addressOffset>
          <fields>
            <field>
              <name>TS0</name>
              <description>TS0</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS1</name>
          <description>desc TS1</description>
          <addressOffset>0x104</addressOffset>
          <fields>
            <field>
              <name>TS1</name>
              <description>TS1</description>
              <bitRange>[10:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS2P</name>
          <description>desc TS2P</description>
          <addressOffset>0x108</addressOffset>
          <fields>
            <field>
              <name>TS2P</name>
              <description>TS2P</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TPS3</name>
          <description>desc TPS3</description>
          <addressOffset>0x10C</addressOffset>
          <fields>
            <field>
              <name>TPS3</name>
              <description>TPS3</description>
              <bitRange>[12:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TS3</name>
          <description>desc TS3</description>
          <addressOffset>0x110</addressOffset>
          <fields>
            <field>
              <name>TS3</name>
              <description>TS3</description>
              <bitRange>[8:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PERTPE</name>
          <description>desc PERTPE</description>
          <addressOffset>0x114</addressOffset>
          <fields>
            <field>
              <name>PERTPE</name>
              <description>PERTPE</description>
              <bitRange>[17:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMERTPE</name>
          <description>desc SMERTPE</description>
          <addressOffset>0x118</addressOffset>
          <fields>
            <field>
              <name>SMERTPE</name>
              <description>SMERTPE</description>
              <bitRange>[17:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRGTPE</name>
          <description>desc PRGTPE</description>
          <addressOffset>0x11C</addressOffset>
          <fields>
            <field>
              <name>PRGTPE</name>
              <description>PRGTPE</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PRETPE</name>
          <description>desc PRETPE</description>
          <addressOffset>0x120</addressOffset>
          <fields>
            <field>
              <name>PRETPE</name>
              <description>PRETPE</description>
              <bitRange>[13:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TACLK2PW</name>
          <addressOffset>0x124</addressOffset>
          <fields>
            <field>
              <name>TACLK2PW</name>
              <description>TACLK2PW</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
