awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F092xx.svd
        <register>
          <name>BDCR</name>
          <description>RTC domain control register</description>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>LSERDY</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSEBYP</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>LSEDRV</name>
              <bitRange>[4:3]</bitRange>
            </field>
            <field>
              <name>LSECSSON</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>LSECSSD</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RTCSEL</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>LSEEN</name>
              <bitRange>[13:10]</bitRange>
            </field>
            <field>
              <name>LSCSEL</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>RTCEN</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>BDRST</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>LSI_TRIMCR</name>
              <bitRange>[25:17]</bitRange>
            </field>
            <field>
              <name>LSION</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>LSIRDY</name>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LSE_RDYSEL</name>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>IWDGSEL</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR</name>
          <description>Control/status register</description>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>NRST_FLTDIS</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>RMVF</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>OBLRSTF</name>
              <bitRange>[25:25]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PINRSTF</name>
              <bitRange>[26:26]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PWRRSTF</name>
              <bitRange>[27:27]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SFTRSTF</name>
              <bitRange>[28:28]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <bitRange>[29:29]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <bitRange>[30:30]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RTC</name>
      <description>desc RTC</description>
      <baseAddress>0x40002800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>RTC</name>
        <description>RTC Interrupt through EXTI Lines 19</description>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>TR</name>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>SU</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ST</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>MNU</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>MNT</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>HU</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>HT</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>PM</name>
              <bitRange>[22:22]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>DU</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>DT</name>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>MU</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>MT</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>WDU</name>
              <bitRange>[15:13]</bitRange>
            </field>
            <field>
              <name>YU</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>YT</name>
              <bitRange>[23:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SSR</name>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SS</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ICSR</name>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>ALRAWF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ALRBWF</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUTWF</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SHPF</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INITS</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>INITF</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>INIT</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>RECALPF</name>
              <bitRange>[16:16]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PRER</name>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PREDIV_S</name>
              <bitRange>[14:0]</bitRange>
            </field>
            <field>
              <name>PREDIV_A</name>
              <bitRange>[22:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WUTR</name>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>WUT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>WUCKSEL</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>TSEDGE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>REFCKON</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>BYPSHAD</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>FMT</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>ALRAE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ALRBE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>WUTE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>TSE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ALRAIE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ALRBIE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>WUTIE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>TSIE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>ADD1H</name>
              <bitRange>[16:16]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>SUB1H</name>
              <bitRange>[17:17]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>BKP</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>COSEL</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>POL</name>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>OSEL</name>
              <bitRange>[22:21]</bitRange>
            </field>
            <field>
              <name>COE</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>ITSE</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>TAMPTS</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>TAMPOE</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>TAMPALRM_PU</name>
              <bitRange>[29:29]</bitRange>
            </field>
            <field>
              <name>TAMPALRM_TYPE</name>
              <bitRange>[30:30]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>WPR</name>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>KEY</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CALR</name>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>CALM</name>
              <bitRange>[8:0]</bitRange>
            </field>
            <field>
              <name>CALW16</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CALW8</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CALP</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SHIFTR</name>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>SUBFS</name>
              <bitRange>[14:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>ADD1S</name>
              <bitRange>[31:31]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSTR</name>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>SU</name>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ST</name>
              <bitRange>[6:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MNU</name>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MNT</name>
              <bitRange>[14:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HU</name>
              <bitRange>[19:16]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>HT</name>
              <bitRange>[21:20]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PM</name>
              <bitRange>[22:22]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSDR</name>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>DU</name>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DT</name>
              <bitRange>[5:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MU</name>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>MT</name>
              <bitRange>[12:12]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WDU</name>
              <bitRange>[15:13]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TSSSR</name>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>SS</name>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMAR</name>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>SU</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ST</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>MSK1</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>MNU</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>MNT</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>MSK2</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HU</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>HT</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>PM</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>MSK3</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DU</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>DT</name>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>WDSEL</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>MSK4</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMASSR</name>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>SS</name>
              <bitRange>[14:0]</bitRange>
            </field>
            <field>
              <name>MASKSS</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMBR</name>
          <addressOffset>0x48</addressOffset>
          <fields>
            <field>
              <name>SU</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>ST</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>MSK1</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>MNU</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>MNT</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>MSK2</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>HU</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>HT</name>
              <bitRange>[21:20]</bitRange>
            </field>
            <field>
              <name>PM</name>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>MSK3</name>
              <bitRange>[23:23]</bitRange>
            </field>
            <field>
              <name>DU</name>
              <bitRange>[27:24]</bitRange>
            </field>
            <field>
              <name>DT</name>
              <bitRange>[29:28]</bitRange>
            </field>
            <field>
              <name>WDSEL</name>
              <bitRange>[30:30]</bitRange>
            </field>
            <field>
              <name>MSK4</name>
              <bitRange>[31:31]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ALRMBSSR</name>
          <addressOffset>0x4C</addressOffset>
          <fields>
            <field>
              <name>SS</name>
              <bitRange>[14:0]</bitRange>
            </field>
            <field>
              <name>MASKSS</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0x50</addressOffset>
          <fields>
            <field>
              <name>ALRAF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ALRBF</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUTF</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSF</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSOVF</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ITSF</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MISR</name>
          <addressOffset>0x54</addressOffset>
          <fields>
            <field>
              <name>ALRAMF</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ALRBMF</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>WUTMF</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSMF</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TSOVMF</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ITSMF</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SCR</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>CALRAF</name>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CALRBF</name>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CWUTF</name>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTSF</name>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CTSOVF</name>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>CITSF</name>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
