awalong133/Hote/EIDE/.pack/Puya/PY32F0xx_DFP.1.2.15/CMSIS/SVD/PY32F092xx.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>TIM1</name>
      <description>Advanced timer</description>
      <groupName>TIM</groupName>
      <baseAddress>0x40012C00</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>TIM1_BRK_UP_TRG_COM</name>
        <description>TIM1 Break, Update, Trigger and Commutation Interrupt</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>TIM1_CC</name>
        <description>TIM1 Capture Compare Interrupt</description>
        <value>14</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>desc CR1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>CEN</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>UDIS</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>URS</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OPM</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>DIR</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CMS</name>
              <bitRange>[6:5]</bitRange>
            </field>
            <field>
              <name>ARPE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CKD</name>
              <bitRange>[9:8]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>desc CR2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>CCPC</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CCUS</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CCDS</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>MMS_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>TI1S</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>OIS1</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>OIS1N</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>OIS2</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OIS2N</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OIS3</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>OIS3N</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>OIS4</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MMS_H</name>
              <bitRange>[25:25]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SMCR</name>
          <description>desc SMCR</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>SMS_L</name>
              <bitRange>[2:0]</bitRange>
            </field>
            <field>
              <name>OCCS</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>TS_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>MSM</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>ETF</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>ETPS</name>
              <bitRange>[13:12]</bitRange>
            </field>
            <field>
              <name>ECE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>ETP</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>SMS_H</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>TS_H</name>
              <bitRange>[21:20]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DIER</name>
          <description>desc DIER</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>UIE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IE</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2IE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3IE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4IE</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMIE</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BIE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>UDE</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC1DE</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC2DE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3DE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4DE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>COMDE</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>TDE</name>
              <bitRange>[14:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR</name>
          <description>desc SR</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>UIF</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1IF</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC2IF</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC3IF</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC4IF</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMIF</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>TIF</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>BIF</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>B2IF</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC1OF</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC2OF</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3OF</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4OF</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>SBIF</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>IC1IR</name>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>IC2IR</name>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>IC3IR</name>
              <bitRange>[24:24]</bitRange>
            </field>
            <field>
              <name>IC4IR</name>
              <bitRange>[25:25]</bitRange>
            </field>
            <field>
              <name>IC1IF</name>
              <bitRange>[26:26]</bitRange>
            </field>
            <field>
              <name>IC2IF</name>
              <bitRange>[27:27]</bitRange>
            </field>
            <field>
              <name>IC3IF</name>
              <bitRange>[28:28]</bitRange>
            </field>
            <field>
              <name>IC4IF</name>
              <bitRange>[29:29]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>EGR</name>
          <description>desc EGR</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>UG</name>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CC1G</name>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CC2G</name>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CC3G</name>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CC4G</name>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>COMG</name>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TG</name>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BG</name>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_OUTPUT</name>
          <description>desc CCMR1:OUTPUT</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CC1S</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC1FE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC1PE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC1M_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>OC1CE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC2S</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC2FE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC2PE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC2M_L</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>OC2CE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OC1M_H</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC2M_H</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR1_INPUT</name>
          <description>desc CCMR1:INPUT</description>
          <alternateRegister>CCMR1_OUTPUT</alternateRegister>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>CC1S</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC1PSC</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IC1F</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CC2S</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC2PSC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IC2F</name>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR2_OUTPUT</name>
          <description>desc CCMR2:OUTPUT</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CC3S</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>OC3FE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>OC3PE</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>OC3M_L</name>
              <bitRange>[6:4]</bitRange>
            </field>
            <field>
              <name>OC3CE</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC4S</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OC4FE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OC4PE</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>OC4M_L</name>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>OC4CE</name>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>OC3M_H</name>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>OC4M_H</name>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCMR2_INPUT</name>
          <description>desc CCMR2:INPUT</description>
          <alternateRegister>CCMR2_OUTPUT</alternateRegister>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CC3S</name>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>IC3PSC</name>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>IC3F</name>
              <bitRange>[7:4]</bitRange>
            </field>
            <field>
              <name>CC4S</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>IC4PSC</name>
              <bitRange>[11:10]</bitRange>
            </field>
            <field>
              <name>IC4F</name>
              <bitRange>[15:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMXCCER</name>
          <addressOffset>0x20</addressOffset>
          <fields>
            <field>
              <name>CC1E</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>CC1P</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>CC1NE</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>CC1NP</name>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>CC2E</name>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>CC2P</name>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>CC2NE</name>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>CC2NP</name>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CC3E</name>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CC3P</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CC3NE</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CC3NP</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CC4E</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CC4P</name>
              <bitRange>[13:13]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CNT</name>
          <description>desc CNT</description>
          <addressOffset>0x24</addressOffset>
          <fields>
            <field>
              <name>CNT</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PSC</name>
          <description>desc PSC</description>
          <addressOffset>0x28</addressOffset>
          <fields>
            <field>
              <name>PSC</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>ARR</name>
          <description>desc ARR</description>
          <addressOffset>0x2C</addressOffset>
          <fields>
            <field>
              <name>ARR</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>RCR</name>
          <description>desc RCR</description>
          <addressOffset>0x30</addressOffset>
          <fields>
            <field>
              <name>REP</name>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR1</name>
          <description>desc CCR1</description>
          <addressOffset>0x34</addressOffset>
          <fields>
            <field>
              <name>CCR1</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR2</name>
          <description>desc CCR2</description>
          <addressOffset>0x38</addressOffset>
          <fields>
            <field>
              <name>CCR2</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR3</name>
          <description>desc CCR3</description>
          <addressOffset>0x3C</addressOffset>
          <fields>
            <field>
              <name>CCR3</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR4</name>
          <description>desc CCR4</description>
          <addressOffset>0x40</addressOffset>
          <fields>
            <field>
              <name>CCR4</name>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>BDTR</name>
          <description>desc BDTR</description>
          <addressOffset>0x44</addressOffset>
          <fields>
            <field>
              <name>DTG</name>
              <bitRange>[7:0]</bitRange>
            </field>
            <field>
              <name>LOCK</name>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>OSSI</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OSSR</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>BKE</name>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>BKP</name>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>AOE</name>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>MOE</name>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TISEL</name>
          <addressOffset>0x5C</addressOffset>
          <fields>
            <field>
              <name>TI1SEL</name>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>TI2SEL</name>
              <bitRange>[11:8]</bitRange>
            </field>
            <field>
              <name>TI3SEL</name>
              <bitRange>[19:16]</bitRange>
            </field>
            <field>
              <name>TI4SEL</name>
              <bitRange>[27:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AF1</name>
          <addressOffset>0x60</addressOffset>
          <fields>
            <field>
              <name>BKINE</name>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>BKCMP1E</name>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>BKCMP2E</name>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>BKINP</name>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>BKCMP1P</name>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>BKCMP2P</name>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>ETRSEL</name>
              <bitRange>[17:14]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>AF2</name>
          <addressOffset>0x64</addressOffset>
          <fields>
            <field>
              <name>OCRSEL</name>
              <bitRange>[18:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCR</name>
          <description>desc DCR</description>
          <addressOffset>0x3DC</addressOffset>
          <fields>
            <field>
              <name>DBA</name>
              <bitRange>[4:0]</bitRange>
            </field>
            <field>
              <name>DBL</name>
              <bitRange>[12:8]</bitRange>
            </field>
          </fields>
        </register>
